<template>
    <div class="myHeader clearfix">
        <div @click="openMenu">
            <!-- svg图片可以通过修改它的fill属性的值来更改其颜色 -->
            <svg t="1719231257882" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1634" width="20"><path d="M925.2 220H100.4c-18.6 0-33.9-15.2-33.9-33.9s15.2-33.9 33.9-33.9h824.7c18.6 0 33.9 15.2 33.9 33.9 0 18.6-15.2 33.9-33.8 33.9z m-2 323.8H98.4c-18.6 0-33.9-15.2-33.9-33.9S79.7 476 98.4 476h824.7c18.6 0 33.9 15.2 33.9 33.9s-15.2 33.9-33.8 33.9z m2.9 324.8H101.4c-18.6 0-33.9-15.2-33.9-33.9s15.2-33.9 33.9-33.9h824.7c18.6 0 33.9 15.2 33.9 33.9s-15.2 33.9-33.9 33.9z m0 0" p-id="1635" fill="#e6e6e6"></path></svg>
        </div>
        <div class="right_block">
            <div>FB657528</div>
            <div class="balance">
                <span >10000000.00</span>
                <span>
                    <svg t="1719233091967" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2672" width="20"><path d="M512 213.312a327.872 327.872 0 0 0-247.68 113.536 42.688 42.688 0 0 1-64.256-56.32C276.416 183.488 387.776 128 512 128c228.992 0 413.568 187.328 418.112 418.112l20.736-21.312a42.688 42.688 0 0 1 60.992 59.712l-93.888 96a43.072 43.072 0 0 1-30.464 12.8 43.072 43.072 0 0 1-30.528-12.8l-93.824-96a42.688 42.688 0 0 1 60.992-59.712l20.48 20.928C840.192 360.576 692.096 213.312 512 213.312zM136.576 416a42.88 42.88 0 0 1 30.464 12.8l93.888 96a42.688 42.688 0 1 1-61.056 59.712l-20.48-20.864C183.872 748.8 331.904 896 512 896a327.872 327.872 0 0 0 247.744-113.472 42.688 42.688 0 1 1 64.256 56.32C747.52 925.888 636.288 981.312 512 981.312c-228.992 0-413.568-187.264-418.048-418.112l-20.8 21.312A42.688 42.688 0 0 1 12.16 524.8l93.888-96a43.072 43.072 0 0 1 30.528-12.8z" fill="#e6e6e6" fill-opacity=".65" p-id="2673"></path></svg>
                </span>
            </div>
            <div>
                <svg t="1719277755813" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3429" width="20"><path d="M692.351549 586.086471H299.494931a38.655903 38.655903 0 0 0 0 77.260607h392.856618a38.655903 38.655903 0 0 0 0-77.260607zM299.494931 502.37468H486.016065a41.574296 41.574296 0 0 0 38.655903-38.655903 37.119907 37.119907 0 0 0-38.655903-38.655904H299.238932a38.655903 38.655903 0 0 0 0 77.260607z m392.856618 244.735388H299.494931a38.655903 38.655903 0 0 0 0 77.260607h392.856618a41.574296 41.574296 0 0 0 38.655903-38.655903 37.119907 37.119907 0 0 0-38.655903-38.655904z" fill="#e6e6e6" p-id="3430"></path><path d="M937.035737 309.095163v-12.902367l-289.791275-296.24246h-450.558874A115.455711 115.455711 0 0 0 80.769078 115.866846v792.26682a115.455711 115.455711 0 0 0 115.91651 115.91651h624.638439a115.455711 115.455711 0 0 0 115.91651-115.91651v-90.214175a38.655903 38.655903 0 0 0-77.260607 0v90.214175a41.574296 41.574296 0 0 1-38.655903 38.655903h-624.638439a41.574296 41.574296 0 0 1-38.655903-38.655903V96.615694a41.574296 41.574296 0 0 1 38.655903-38.655903h379.698251v257.586556a41.574296 41.574296 0 0 0 38.655903 38.655903h251.186572v270.488924a38.655903 38.655903 0 1 0 77.260607 0l-6.451184-315.596011z m-283.391291-32.204719V115.918046l154.572413 161.023598h-154.521213z" fill="#e6e6e6" p-id="3431"></path></svg>
            </div>
        </div>
    </div>
</template>
    
<script setup lang='js'>
    import { toRefs, ref } from 'vue'
    import { useStore } from 'vuex'
    const store = useStore();

    const { isShow } = toRefs(store.state)

    const openMenu = ()=> {
        console.log('点击了')
        store.commit('changeIsShow', true)
    }

</script>
    
<style scoped lang='less'>
    /* 
        less的一些特性：
            嵌套：子元素的样式可以写到父元素里边
            定义变量：@xxx: css属性值
            ::before伪元素前边有&
            变量有块级作用域
            变量值可以进行运算
    */
    //头部背景颜色
    @base-color: #2b50e7;
    
    .myHeader {
        position: fixed;
        width: 100%;
        background: @base-color;
        padding: 5% 2%;
        border-radius: 0 0 10% 10%;
        display: flex;
        justify-content: space-between;
    }
    .myHeader>* {
        color: white;
    }
    .right_block {
        min-width: 55%;
        display: flex;
        justify-content: space-around;
    }
    .right_block div {
        padding-top: 2%;
    }
    .right_block .balance {
        min-width: 37%;
        border-radius: 16px;
        border: 1px solid;
        padding: 1%;
        background:hsla(0, 0%, 100%, 0.15);
        display: flex;
        justify-content: space-between;
    }
    .balance svg {
        fill: red;
    }
</style>
